{
	"_meta": {
		"sources": [
			{
				"json": "Homebrewed Weapons and Armor",
				"abbreviation": "SHBW",
				"full": "Suracha's Homebrewed Weapons and Armors",
				"authors": [
					"Suracha-123"
				],
				"version": "1.0",
				"targetSchema": "1.0.0"
			}
		],
		"dateAdded": 1537874753,
		"dateLastModified": 1537874753
	},
	"item": [
		{
			"name": "Dragonscale Armor",
			"type": "Armor (medium)",
			"armor": true,
			"rarity": "none",
			"value": 200000,
			"weight": 25
			"source": "SHBW",
			"entries": [
				"An unusual and rare type of scale mail, this piece is made of the interwoven scales of a dragon. Flexible, but still extremely durable, they provide just as much protection as solid steel when properly locked together. Each suit of Dragonscale Armor is unique, as the age of dragon defines the rigidity of the scales, and their species defines the resistances the suit provides. Generally, younger scales allow for more agility and stealth, while older ones provide better up-front protection. As well as a resistance to the element of the dragon's breath weapon, all Dragonscale Armors provide resistance to all breath weapons of the dragon's type (chromatic or metallic)."
			]
		},
		{
			"name": "Kusarigama",
			"type": "M",
			"weaponCategory": "simple",
			"weight": 4,
			"dmg1": "1d8",
			"dmg2": "1d4",
			"dmgType": "S/P/B"
			"property": [ 
				"R",
				"F"
			],
			"rarity": "uncommon",
			"value": 15000,
			"source": "SHBW",
			"entries": [
				"The exotic, rare and unusual Kusarigama (lit., Chain Sickle) consists of a Kama, usually larger than most, attached via a chain or rope to a weight, blade, or second Kama. While it can be used as a simple warpick and chain by anyone, trained monks perform dazzling flourishes with this weapon, which is as dangerous to its target as it is to its user. When held by its chain, the Kusarigama can be used to strike with the Kama at great range, with blinding and armor-piercing speed, dealing {@dice 1d8} slashing or piercing damage. Afterwards, the user can follow up with an equally rapid attack with the backside, which is traditionally a heavy, blunt metal weight, dealing {@dice 1d4} bludgeoning damage. Alternatively, the Kusarigama can be used to entangle an enemy, restraining their movement or actions to a certain degree if successful. Requires the user to have studied Monk weapons and have a Dexterity of 14 or more to be used to its fullest potential."
			]
		},
		{
			"name": "Khakkhara",
			"type": "S",
			"weaponCategory": "simple",
			"weight": 3,
			"dmg1": "1d8",
			"dmg2": "1d4",
			"dmgType": "S",
			"property": [
				"V"
			],
			"rarity": "none",
			"value": 16000,
			"source": "SHBW",
			"entries": [
				"An exotic staff, with an ornate, bladed metal circle at one end, with metal rings dangling from it. Sometimes known as a Shakujo, or Ringstaff, this staff serves as a walking cane for wandering priests, with the clanging rings warning small animals to move away, lest they be inadvertently stepped on by. Ironically, despite its use as a tool of peace and tranquility, it can be used as a weapon by some monks. Its bladed top side is especially useful, dealing {@dice 1d8} damage when used with both hands. The wielder may choose to stab forward with one hand, in order to confuse their target with the sounds and movement of the rings. When doing so, they deal {@dice 1d4} damage, and the target must succeed a Constitution saving throw or be either blinded, deafened, or both, for one or two rounds."
			]
		},
		{
			"name": "Man-Catcher",
			"type": "M",
			"weaponCategory": "martial",
			"weight": 7,
			"dmg1": "1d6",
			"dmgType": "B",
			"property": [
				"V",
				"R",
				"F"
			],
			"rarity": "none",
			"source": "SHBW",
			"value": 8000,
			"entries": [
				"City watchmen, guards or formalised police often considered non-lethal options for their arsenals, to more humanely apprehend criminals so that they may be brought to justice. Man-catchers are any type of primarily non-lethal polearm that is used to push, move, catch, grapple or otherwise manipulate adversaries or targets at a reasonable distance. Examples include the catchpole and sasumata, crescent-shaped staves meant to catch and pin down a target's limbs or neck, the tsukubo, a T-shaped pole for pushing or tripping, or the sodegarami, a hooked polearm made to cling to clothing and armor. Any such polearm can be used to grapple a target from a distance, with increasing efficiency if more than one user focuses on the same target. They may also be used to bash an opponent, dealing {@dice 1d6} bludgeoning damage, or grab a Large or Huge target, or a Gargantuan target's limbs or sections, when used in a formation."
			]
		},
		{
			"name": "Combination Shield",
			"type": "S",
			"weight": 4,
			"ac": 1,
			"rarity": "uncommon",
			"value": 100000,
			"source": "SHBW",
			"entries": [
				"Ranging between mechanical wonders tinkered by gnomes and bulky abominations that can barely be called a shield anymore, Combination Shields are any combination between a shield and another weapon, mechanism or tool. The legendary Lantern Shield is a particularly peculiar example, a small circular metal shield with an integrated sword blade, spikes, a metallic gauntlet and, of course, a lantern. Another example are Gun Shields, gnomish creations which release a revolving metal shield with an integrated smokepowder gun. While they may work reasonably (though unreliably) well at providing the benefits of all their integrated tools, they are, of course, less useful than a regular shield in terms of raw protection." 
			]
		},
		{
			"name": "Blade Gauntlet",
			"type": "M",
			"rarity": "none",
			"value": 30000,
			"source": "SHBW",
			"entries": [
				"Blade Gauntlets range between unarmored, knife-sized Katars and impressive Patas with full hand and forearm protection and full-sized sword blades. Effectively a sword or dagger on a metal glove or perpendicular handle, Blade Gauntlets are a more defensive weapon, which relies less on dexterous swordmanship and a trained wrist, and more on straightforward cuts and armor. The user of a Blade Gauntlet can choose to add +1 to their AC at the cost of -1 on attack rolls with the weapon, as the forearm cover does not allow for any movement of the wrist, but prevents counterattacks aiming for the hand. Otherwise, the Blade Gauntlet functions as a regular weapon."
			]
		},
		{
			"name": "Parrying Dagger",
			"type": "M",
			"rarity": "none",
			"value": 25000,
			"source": "SHBW",
			"entries": [
				"Including weapons such as the Main-Gauche, the Sword-Breaker, and the Rondel Dagger, Parrying Daggers are daggers mainly meant for the off-hand, used, unsurprisingly, for parrying or catching an opponent's weapon, but also to deliver swift, piercing strikes. The Stiletto is an example of a specialised thrusting dagger. Most such daggers can be used to push into the weak points of an opponent's armor when the latter is distracted, grappled, or prone - with the exception of the Sword-Breaker, as its pronged blade is too wide, and better suited for defense rather than offense. The Trident Dagger is a type of Parrying Dagger which has a hidden mechanism that, when triggered, deploys two hidden blades to the side of the main blade; these can be used offensively, or squeezed together to catch and trap the weapon of an opponent. Such a technological marvel, however, is bound to be rare and expensive."
			]
		},
		{
			"name": "Chu-ko-nu",
			"type": "R",
			"weaponCategory": "martial",
			"weight": 15,
			"dmg1": "1d4",
			"dmgType": "P",
			"property": [
				"A",
				"H",
			],
			"range": "20/80",
			"rarity": "uncommon",
			"value": 150000,
			"source": "SHBW",
			"entries": [
				"An ancient, but not quite obsolete design. The Chu-ko-nu, originally known as Lian Nu or Zhuge Nu, is a hip-mounted repeating crossbow that takes little Strength, Dexterity or training to use effectively. Place the stock on the hip, face the enemy's general direction, and begin cranking the lever. The inner mechanisms will then draw the crossbow, load a bolt from a top-mounted magazine, and release the bow; then repeat. While lightning-fast compared to any normal crossbow (or even bow), its accuracy, draw weight and, thus, range and damage leave much to be desired. The Chu-ko-nu user can fire 2 shots within one Attack action as long as their target is in regular range. Alternatively, if the target is more than 20 feet away, the user may fire 3 shots during a single Attack action - however, they have a disadvantage on each attack roll. As the user does not need to reload between shots, on average, this still means more successful hits than a regular crossbow. Nevertheless, he Chu-ko-nu truly shines when faced with larger groups of enemies and loaded with poison-tipped or otherwise special or enchanted bolts, wherein it can expell a great volume of ammunition that is bound to hit a target and deliver its damage."
			],
			"ammoType": "crossbow bolt|phb"
		},
		{
			"name": "Rope Dart",
			"type": "M",
			"weaponCategory": "simple",
			"weight": 1,
			"dmg1": "1d4",
			"dmg2": "1d6"
			"dmgType": "P",
			"property": [
				"V", 
				"R",
				"F"
			],
			"rarity": "none",
			"value": 2000,
			"source": "SHBW",
			"entries": [
				"A simple dart or small dagger at the end of a rope, can be coiled around a limb (including legs if the user is skilled enough) and thrown out suddenly at range. Used to keep a target at bay and rapidly throw and pull back the dart, which may be covered in poison or oil. Provides better accuracy and damage if used with two hands, rather than one."
			],
		},
		{
			"name": "Simple Flails",
			"type": "M",
			"weaponCategory": "simple",
			"weight": 3,
			"dmg1": "1d4",
			"dmg2": "1d8"
			"dmgType": "P",
			"property": [
				"R",
				"F"
			],
			"rarity": "none",
			"value": 4000,
			"source": "SHBW",
			"entries": [
				"Varying between the Nunchaku rice flail and the chain whip or 9-section whip, non-military flails are repurposed agricultural tools, used as weapons relying on centrifugal force. Shorter ones, like Nunchaku, can be dual-wielded. Longer ones, like the chain whip, can be used at a longer range and deal greater damage."
			],
		},
		{
			"name": "Falx",
			"type": "M",
			"weaponCategory": "martial",
			"weight": 7;
			"dmg1": "2d6";
			"dmgType": "S/P";
			"property": [
				"R",
				"2H"
			],
			"rarity": "uncommon",
			"value": 150000,
			"source": "SHBW",
			"entries": [
				"A rare and unusual sword, the Falx is a long, forward-curved blade with a handle of almost equal length. Its size is imposing enough, reaching polearm-like lengths, but its true strength is the hook-like blade. The point can easily curve around shields and weapons and pierce most armours and helmets, and the curved blade can cut through a shield like a red-hot knife through cheese, even cutting the hand holding it. The Falx has a +2 to attack rolls against enemies using shields, effectively negating their AC bonus. It also has a +2 to attack rolls against enemies wearing any medium armor other than a breastplate or half-plate, and a +1 to attack rolls against enemies wearing light or no armor. These do not stack with the bonus against shields. However, the cumbersome two-handed length and the forward-curved blade negatively impact a user's defenses... though there are tales of ancient warriors charging into enemy formations with nothing but a Falx and simple farmers' clothing, twisting and turning and taking them apart in a whirlwind of heavy blows and dodges. A Falx user must have a Dexterity above 15 or receive formal training with this weapon from any surviving master, if they exist, in order to negate its AC penalty."
			]
		},
		{
			"name": "Shuang Gou",
			"type": "M",
			"weaponCategory": "martial",
			"weight": 3;
			"dmg1": "1d8";
			"dmg2": "2d8",
			"dmgType": "S";
			"property": [
				"R"
			],
			"rarity": "uncommon",
			"value": 100000,
			"source": "SHBW",
			"entries": [
				"An exotic type of sword, the Shuang Gou is often referred to as hook sword, or twin hooks. Used mostly in pairs, it has a large and sharp guard and an equally sharp pommel, which can both be used for striking or stabbing at close quarters. The very pronounced hook of the sword allows for both slashing and grabbing, whether to grapple or to pull aside an opponent's weapon. When dual-wielded, the swords can be hooked together and used as a large bladed flail of sorts, with extra reach and damage."
			]
		},
		{
			"name": "Jitte",
			"type": "M",
			"weaponCategory": "martial",
			"rarity": "uncommon",
			"value": 250000,
			"weight": 4,
			"dmg1": "1d8",
			"dmgType": "B",
			"property": [
				"F"
			],
			"source": "SHBW",
			"entries": [
				"The odd offspring of a sword and a bailiff's mace, the Jitte was both a weapon and a sign of power. Hailing from Kozakura, where bringing a sword into the Imperial Palace was a capital offense, it served as the main weapon and badge of office for the Imperial Police and the Royal Guard. In simple terms, it is a sword with a blunt steel bar for a blade, and a protruding hook used for catching weapons and pushing into an oppoent's pressure points. The user of a Jitte can more easily knock an opponent unconscious, has advantage on grapples against unarmed enemies or enemies using a single sword, and a +1 to AC against sword attacks. Additionally, nobles and educated townsfolk will recognize the Jitte as a status symbol, and treat its wielder with considerably more respect. These weapons are particularly rare and precious due to their cultural and legal significance, and anyone who knows their value is unlikely to part with them willingly."
			]
		},
		{
			"name": "Sai",
			"type": "Weapon (dagger)",
			"weight": 2,
			"dmg1": "1d4",
			"dmg2": "1d6",
			"dmgType": "B/P",
			"property": [
				"F"
			],
			"rarity": "none",
			"value": 25000,
			"source": "SHBW",
			"entries": [
				"An apparently improvised weapon, the Sai resembles a pointy pitchfork more than any regular dagger. Used in pairs whenever possible, the Sai is meant to catch an enemy's weapon and retaliate with the offhand. By itself, a Sai is essentially a specialised dagger, but when dual-wielding, a trained Sai user can deliver a precise strike when a melee attack against them misses or is blocked. Its similarity to the Jitte allows the two to be paired quite effectively, but the user must keep in mind that the Jitte is a symbol of authority, while the Sai is the weapon of a dishonorable assassin."
			]
		},
		{
			"name": "Dwarven Mine Partisan",
			"type": "M",
			"weight": 8,
			"dmg1": "1d8",
			"dmg2": "1d10",
			"dmg3": "1d6",
			"dmgType": "S/P/B",
			"property": [
				"V",
				"R",
				"H"
			],
			"rarity": "uncommon",
			"value": 350000,
			"source": "SHBW",
			"entries": [
				"A masterful design, the Mine Partisan was originally based on a gnomish blueprint, commissioned by Mountain Dwarves who needed a weapon that would fit their terrifying phalanxes, while still being practical underground. The result was a medium-length metal rod with wood and leather coverings, which could be unfolded into a full-sized partisan with the flick of a switch, conveniently located at the bottom of the rod. This weapon is especially versatile, as it can be carried folded and either used as a mace or quickly and easily deployed when needed - it also has the perfect length for a dwarf: long enough to be used in formation, and short enough to not hit the cavern walls and ceiling when patrolling the mines. As with most dwarven things, it is especially wide and heavy, even for a polearm, but remarkably sturdy and reliable, and wickedly sharp."
			]
		},
		{
			"name": "Elven Longblade",
			"type": "Weapon (rapier)",
			"weaponCategory": "martial",
			"weight": 1,
			"dmg1": "1d8",
			"dmgType": "P/S",
			"property": [
				"F",
				"L"
			],
			"rarity": "none",
			"value": 35000,
			"source": "SHBW",
			"entries": [
				"This thin sword is uncannily quick to strike. This weapon has the light property and can deal piercing or slashing damage."
			]
		},
		{
			"name": "Elven Samaren",
			"type": "M",
			"weaponCategory": "martial",
			"weight": 3,
			"dmg1": "1d8",
			"dmg2": "1d10 + 1d6",
			"dmgType": "S",
			"property": [
				"V"
			],
			"rarity": "none",
			"value": 35000,
			"source": "SHBW",
			"entries": [
				"This sword has a second, smaller blade extending from the pommel. If you are wielding this weapon two handed and you use the attack action to make a melee attack with it on your turn, you can use a bonus action to make a melee attack with the second blade as if you were two weapon fighting. This attack deals {@dice 1d6} slashing damage."
			]
		},
		{
			"name": "Gnome Hooked Hammer",
			"type": "Weapon (light hammer)",
			"weaponCategory": "simple",
			"weight": 2,
			"dmg1": "1d8",
			"dmgType": "B",
			"property": [
				"L",
				"T"
			],
			"range": "20/60",
			"rarity": "none",
			"value": 25000,
			"source": "SHBW",
			"entries": [
				"This cleverly forged hammer has a long hook affixed to one end of its head. This weapon deals {@dice 1d8} damage. When wielding this weapon, you can use your bonus action to attempt to trip a creature within 5 feet of you. If the target is Medium or smaller, it must make a strength saving throw (DC 8 + your proficiency bonus + your strength modifier) or be knocked prone."
			]
		},
		{
			"name": "Halfling Glader",
			"type": "Weapon (scimitar)",
			"weaponCategory": "martial",
			"weight": 3,
			"dmg1": "1d6",
			"dmgType": "S",
			"property": [
				"F",
				"L",
				"T"
			],
			"range": "20/60",
			"rarity": "none",
			"value": 35000,
			"source": "SHBW",
			"entries": [
				"This boomerang-shaped sword is constructed out of wood sharpened to a fine edge. This weapon has the thrown property with a normal range of 20 feet and a long range of 60 feet. Once per turn you can use your action to make a special ranged attack with this weapon: immediately after the attack, the weapon flies back to your hand."
			]
		},
		{
			"name": "Katana",
			"type": "M",
			"weaponCategory": "martial",
			"weight": 3,
			"dmg1": "1d8",
			"dmg2": "1d10",
			"dmgType": "S",
			"property": [
				"V",
				"F"
			],
			"rarity": "none",
			"value": 35000,
			"source": "SHBW",
			"entries": [
				"This gently curved sword allows a properly trained wielder to make blindingly quick strikes, despite its length. This weapon has the finesse property."
			]
		},
		{
			"name": "Katar",
			"type": "Weapon (shortsword)",
			"weaponCategory": "martial",
			"weight": 2,
			"dmg1": "1d6",
			"dmgType": "P",
			"property": [
				"F",
				"L"
			],
			"rarity": "none",
			"value": 4000,
			"source": "SHBW",
			"entries": [
				"This sword is held with the blade extending forwards from the knuckles, allowing it to be used with a punching motion. You may use your bonus action to make weapon attacks with this weapon instead of unarmed strikes when using the monk's Flurry of Blows and Martial Arts class features."
			]
		},
		{
			"name": "Kukri",
			"type": "Weapon (dagger)",
			"weaponCategory": "simple",
			"weight": 1,
			"dmg1": "1d6",
			"dmgType": "S",
			"property": [
				"F",
				"L",
				"T"
			],
			"range": "20/60",
			"rarity": "none",
			"value": 4000,
			"source": "SHBW",
			"entries": [
				"The heavy, curved blade of this dagger lends it superior cutting power and force. This weapon deals {@dice 1d6} slashing damage."
			]
		},
		{
			"name": "Masterwork Weapon",
			"type": "Weapon (any)",
			"rarity": "none",
			"value": 30000,
			"source": "SHBW",
			"entries": [
				"This weapon has been flawlessly crafted. You gain a +1 bonus to attack rolls made with this weapon."
			],
			"bonusWeaponAttack": "+1"
		},
		{
			"name": "Mithral Armor",
			"type": "Armor (medium or heavy, but not hide)",
			"rarity": "none",
			"value": 5000,
			"source": "SHBW",
			"entries": [
				"Mithral is a light, flexible metal. A mithral Chain Shirt or Breastplate can be worn under normal clothes. If the armor normally imposes disadvantage on Dexterity (Stealth) checks or has a Strength requirement, the mithral version of the armor doesn't. Mithral armor weighs half as much as its mundane equivalent."
			]
		},
		{
			"name": "Mithral Weapon",
			"type": "Weapon (any metal)",
			"rarity": "none",
			"value": 5000,
			"source": "SHBW",
			"entries": [
				"This weapon was cast from mithral and feels feather-light in the hand. If a weapon does not have either the heavy or two handed property, the mithral version has the light property. This weapon weighs half as much as its mundane equivalent."
			]
		},
		{
			"name": "Nunchaku",
			"type": "Weapon (club)",
			"weaponCategory": "simple",
			"weight": 2,
			"dmg1": "1d4",
			"dmg2": "2d4",
			"dmgType": "B",
			"property": [
				"L",
				"F",
				"V"
			],
			"rarity": "none",
			"value": 3000,
			"source": "SHBW",
			"entries": [
				"This weapon consists of two balanced clubs connected with rope or chain. It has the finesse and versatile properties and deals {@dice 2d4} damage when wielded with two hands."
			]
		},
		{
			"name": "Orc Double Axe",
			"type": "Weapon (greataxe)",
			"weaponCategory": "martial",
			"weight": 7,
			"dmg1": "1d8",
			"dmgType": "S",
			"property": [
				"H",
				"2H"
			],
			"rarity": "none",
			"value": 35000,
			"source": "SHBW",
			"entries": [
				"This brutal weapon has axe heads at either end of its haft. This weapon deals {@dice 1d8} damage. When you use the attack action on your turn to make a melee attack with this weapon, you can use a bonus action to make a melee attack with the second axe head as if you were two weapon fighting."
			]
		},
		{
			"name": "Recurve Bow",
			"type": "Weapon (longbow)",
			"weaponCategory": "martial",
			"weight": 2,
			"dmg1": "1d10",
			"dmgType": "P",
			"property": [
				"A",
				"2H"
			],
			"range": "150/600",
			"rarity": "none",
			"value": 50000,
			"source": "SHBW",
			"entries": [
				"This compact bow takes on a double curve when strung to increase the power of its shot. This weapon deals {@dice 1d10} damage and does not have the heavy property."
			],
			"ammoType": "arrow|phb"
		},
		{
			"name": "Silvered Weapon",
			"type": "Weapon (any)",
			"rarity": "none",
			"value": 10000,
			"source": "SHBW",
			"entries": [
				"This weapon has been carefully plated with silver so as not to undermine its effectiveness. Some monsters that are resistant or immune to nonmagical weapons are susceptible to silver weapons."
			]
		},
		{
			"name": "Spiked Chain",
			"type": "Weapon (whip)",
			"weaponCategory": "martial",
			"weight": 3,
			"dmg1": "2d4",
			"dmgType": "S",
			"property": [
				"F",
				"R"
			],
			"rarity": "none",
			"value": 35000,
			"source": "SHBW",
			"entries": [
				"This long, carefully balanced chain has wicked spikes affixed to it and a ring at the end for a grip. This weapon deals {@dice 2d4} damage."
			]
		},
		{
			"name": "Spiked Gauntlets",
			"type": "Item",
			"weight": 1,
			"dmg1": "+1 to unarmed strikes",
			"dmgType": "P",
			"rarity": "none",
			"value": 5000,
			"source": "SHBW",
			"entries": [
				"These gauntlets have had spikes affixed to the knuckles. This item causes the wearer's unarmed strikes with their fists to deal 1 extra point of piercing damage. This item weighs 1lb."
			]
		},
		{
			"name": "Sword-Staff",
			"type": "Weapon (halberd)",
			"weaponCategory": "martial",
			"weight": 6,
			"dmg1": "1d12",
			"dmgType": "P/S",
			"property": [
				"H",
				"R",
				"2H"
			],
			"rarity": "none",
			"value": 30000,
			"source": "SHBW",
			"entries": [
				"This unusual polearm has a long, sword-like blade at the tip. This weapon deals {@dice 1d12} piercing or slashing damage."
			]
		},
		{
			"name": "Tower Shield",
			"type": "S",
			"weight": 12,
			"ac": "3",
			"stealth": true,
			"rarity": "none",
			"value": 25000,
			"source": "SHBW",
			"entries": [
				"This thick, unwieldy shield is large enough to cover you from ankle to shoulder. It increases your armor class by 3 (this replaces the shield's normal bonus to AC.) While this shield is equipped, you have disadvantage on Dexterity (Stealth) checks, and if your Strength score is lower than 15, your speed is reduced by 10 feet as if you were wearing heavy armor. It weighs twice as much as a regular shield."
			]
		},
		{
			"name": "Two-Bladed Sword",
			"type": "Weapon (greatsword)",
			"weaponCategory": "martial",
			"weight": 6,
			"dmg1": "1d8",
			"dmgType": "S",
			"property": [
				"H",
				"2H"
			],
			"rarity": "none",
			"value": 55000,
			"source": "SHBW",
			"entries": [
				"This sword has a blade extending from either end of its hilt. This weapon deals {@dice 1d8} damage. When you use the attack action on your turn to make a melee attack with this weapon, you can use a bonus action to make a melee attack with the second blade as if you were two weapon fighting."
			]
		}
	],
	"variantrule": [
		{
			"name": "Combining Materials",
			"entries": [
				"You may have the prodigious funds necessary to mix different types of exotic materials, but some exotic materials don't make sense together. For example, armor made of mithral and adamantine can only gain benefits from one of the source materials.",
				"The exceptions to this rule are masterwork weapons and silvered weapons. It is entirely possible to commission a silvered masterwork mithral katana for 900gp. On the other hand, if you were to commission a darkwood spear with a mithral speartip it would have the same properties as a darkwood spear with a normal tip, the mithral would just be a costly decoration."
			],
			"source": "SHBW"
		},
		{
			"name": "Magical Exotic Weapons",
			"entries": [
				"Exotic weapons can be enchanted just like regular weapons. When determining the rarity of such an item, an uncommon exotic item should be considered equivalent to a +1 magical weapon.",
				"For example, a +1 bastard sword would be a rare magic item, whereas a +1 longsword is merely uncommon. Similarly, a +1 mithril bastard sword might be considered a very rare magic item."
			],
			"source": "SHBW"
		}
	]
}
