{
	"siteVersion": "1.152.1",
	"_meta": {
		"sources": [
			{
				"json": "NewSpells",
				"abbreviation": "NS",
				"full": "New Spells",
				"url": "",
				"authors": [],
				"convertedBy": []
			}
		],
		"dateAdded": 1648047849,
		"dateLastModified": 1648047849
	},
	"spell": [
		{
			"name": "Galanodel's Sermon of Swords",
			"source": "NewSpells",
			"level": 6,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "self"
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "one slashing or piercing melee weapon"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 10
					},
					"concentration": true
				}
			],
			"entries": [
				"You begin speaking a prayer while brandishing the weapon used as a material component for this spell. For the duration, a 30-foot aura extends from you. ",
				"Creatures of your choice within the aura who can hear you gain a +1 bonus to their armor class and have advantage on Dexterity saving throws against damaging spells and effects, with spectral blades parrying and blocking blows directed against them. They may also use their reaction at any point to make a melee attack against a creature within range. ",
				"Additionally, when you cast this spell, and as an action on subsequent turns, you may raise your voice into a loud sermon praising your deity, calling on their combat prowess to aid you. Every creature of your choice within the aura must make a Dexterity saving throw, as copies of your weapon shining with divine energy appear and strike at them. A creature takes {@damage 7d6} slashing damage if it fails this saving throw, or half as much if it succeeds. You may not make use of this action if you cannot speak, such as when under the effect of a {@spell silence} spell."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Cleric",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Naraeth's Icicle Stream",
			"source": "NewSpells",
			"level": 3,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "line",
				"distance": {
					"type": "feet",
					"amount": 90
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "an ice cube"
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You trace your hand in a circle, briefly opening a portal to an icy demiplane, releasing a flurry of razor-sharp icicles in a line 90 feet long and 5 feet wide from a point of your choosing within 60 feet of you. The first creature in the line starting from the portal's location must make a Dexterity saving throw, taking {@damage 6d8} piercing damage on a failure or half as much on a success. ",
				"If the creature avoided any of the damage, whether by succeeding the saving throw or by virtue of damage resistance, immunity or some other feature, the next creature in the line must also make a Dexterity saving throw. This creature takes the remainder of the damage on a failure. If the second creature succeeds its saving throw, it takes no damage, and the icicles proceed to the next creature, until all their damage is dealt or there are no creatures left in the area."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Wizard",
						"source": "PHB"
					},
					{
						"name": "Sorcerer",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Naraeth's Wall of Cold",
			"source": "NewSpells",
			"level": 4,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "line",
				"distance": {
					"type": "feet",
					"amount": 90
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "an ice cube"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1
					},
					"concentration": true
				}
			],
			"entries": [
				"You rip the Weave to open and hold a rift to the Para-Elemental Plane of Ice, which takes the form of a transparent wall within range and lasts for the duration. You can make the wall up to 60 feet long, 20 feet high, and 5 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 5 foot thick. ",
				"Creatures may attempt a DC 15 Wisdom (Perception) check to discern the warping space and freezing air emanating from it, but the wall is {@condition invisible} otherwise.",
				"When the wall appears, each creature within its area must make a Constitution saving throw. On a failed save, a creature takes {@damage 4d8} cold damage, or half as much damage on a successful save. A creature takes the same damage when it enters or touches the wall for the first time on a turn or ends its turn there. ",
				"The wall also extinguishes all nonmagical flames and all magical fire created by spells of 4th level or lower in its area and within 5 feet of it, and deals maximum damage to fire-based creatures of the elemental type. Heated or burning ammunition or attacks passing through it are also extinguished."
			],
			"conditionInflict": [
				"invisible"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Wizard",
						"source": "PHB"
					},
					{
						"name": "Sorcerer",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Naraeth's Shattering Frost",
			"source": "NewSpells",
			"level": 5,
			"school": "V",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "cone",
				"distance": {
					"type": "feet",
					"amount": 60
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "a reptilian scale, painted white or silver"
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"A swirling storm of frost pours forth from your open mouth, freezing solid the moisture in the air around it as it travels. Each creature in a 60-foot cone must make a Dexterity saving throw. A creature takes {@damage 5d8} cold damage on a failed save, or half as much damage on a successful one. ",
				"If a creature fails the save, it is {@condition restrained} by shards of ice spanning across its skin until the end of its next turn; otherwise, its movement speed is reduced by 10 ft. for the same duration.",
				"A creature ignores these effects if it is immune to cold damage."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Wizard",
						"source": "PHB"
					},
					{
						"name": "Sorcerer",
						"source": "PHB"
					},
					{
						"name": "Druid",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Glorious Charge",
			"source": "NewSpells",
			"level": 2,
			"school": "E",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "radius",
				"distance": {
					"type": "feet",
					"amount": 30
				}
			},
			"components": {
				"v": true,
				"m": "a melee weapon"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1,
						"upTo": true
					}
				}
			],
			"meta": {
				"ritual": true
			},
			"entries": [
				"You raise your weapon to the sky and inspire your allies to charge forward. Choose up to six willing creatures within range. For the duration, the chosen creatures can use a bonus action to move up to their walking speed towards a hostile creature they can see. If a creature affected by the spell deals damage to a target, the spell ends, and the target takes an extra {@damage 1d6} radiant or necrotic damage (your choice) if the damage was dealt by a melee attack. "
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature and the extra damage on attacks increases by {@damage 1d6} for each slot level above 2nd."
					]
				}
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Bard",
						"source": "PHB"
					},
					{
						"name": "Cleric",
						"source": "PHB"
					},
					{
						"name": "Paladin",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Arauthator's Wingbreak",
			"source": "NewSpells",
			"level": 3,
			"school": "T",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 300
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "two iron nails or spikes, cold-forged"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1
					}
				}
			],
			"entries": [
				"You launch spectral binding spikes into the wings of a flying creature you can see within range.",
				"The target must make a Dexterity saving throw, taking {@damage 2d6} piercing damage on a failure or half as much on a success. If a creature flies without the use of wings, it automatically succeeds on the saving throw. ",
				"Creatures who fail the saving throw emit a sickening crunch as their wings bend unnaturally and are {@condition paralyzed} for the duration. The target cannot use its wings to fly, swim or attack with them, or for anything else that would require moving them. A creature which can hover remains suspended in the air, unable to move, while creatures without this ability plummet to the ground, taking fall damage as usual.",
				"A target may make a Constitution saving throw at the end of its subsequent turns, ending the effect on itself on a success."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. "
					]
				}
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Wizard",
						"source": "PHB"
					},
					{
						"name": "Sorcerer",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Arauthator's Shock Mortal Mind",
			"source": "NewSpells",
			"level": 5,
			"school": "E",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 120
				}
			},
			"components": {
				"s": true
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "day",
						"amount": 1
					}
				}
			],
			"entries": [
				"You send visions of diabolical perversion and knowledge towards a creature within range, crippling their mind. The target must succeed on an Intelligence saving throw or be affected by the spell for the duration. This spell has no effect on creatures with an Intelligence score lower than 7, and creatures with a natural life expectancy of 1000 years or more, or with unnaturally long lifespans -  whether through magic, via the Timeless Body feature, or by other means - have advantage on the saving throw. ",
				"While affected by this spell, a creature has disadvantage on attack rolls and ability checks, and whenever the creature casts a spell, it must make a DC 15 Constitution saving throw. On a failure, the spell has no effect. ",
				"At the end of each of its turns, the target can make another Intelligence saving throw. On a success, the spell ends on the target."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 6th level or higher, you can target one additional creature for each slot level above 5th."
					]
				}
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Wizard",
						"source": "PHB"
					},
					{
						"name": "Warlock",
						"source": "PHB"
					},
					{
						"name": "Cleric",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Precipice Gaze",
			"source": "NewSpells",
			"level": 3,
			"school": "D",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 60
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "a recording of occult knowledge worth at least 100 gp, such as an archfiend's lore inscribed in a scroll or a tome, carved on dragon knucklebones, etc."
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"meta": {
				"ritual": true
			},
			"entries": [
				"You attempt to peer past the veil between the worlds to behold forbidden knowledge, or bestow this knowledge upon others. Choose a creature within range. You may then choose one of the following effects.",
				{
					"type": "entries",
					"name": "Glean",
					"entries": [
						"The knowledge the creature seeks is delivered, but its alien origin causes a splitting headache. The creature takes {@damage 1d4} psychic damage, and can add the same amount or their proficiency bonus - whichever is higher - to one ability check they make within the next hour."
					]
				},
				{
					"type": "entries",
					"name": "Shake",
					"entries": [
						"The creature's mind is overwhelmed with odious and illogical truths. The creature takes {@damage 4d4} psychic damage and is {@condition stunned} until the end of their next turn."
					]
				},
				"An unwilling creature may attempt a Wisdom saving throw. On a success, they are not {@condition stunned} by Shake, and the psychic damage they take from this spell is halved."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell with a spell slot of 4th level or higher, the damage and bonus to ability checks caused by Glean increases by {@damage 1d4}, and the damage caused by Shake increases by {@damage 2d4}, for every spell slot level above 3rd, up to a maximum of {@damage 3d4} (Glean) and {@damage 8d4} (Shake) with a spell slot of level 5th or higher."
					]
				}
			],
			"conditionInflict": [
				"stunned"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Sorcerer",
						"source": "PHB"
					},
					{
						"name": "Warlock",
						"source": "PHB"
					},
					{
						"name": "Cleric",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Planar Chains",
			"source": "NewSpells",
			"level": 3,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "reaction",
					"condition": "which you take when you notice a creature within range teleport"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 120
				}
			},
			"components": {
				"s": true,
				"m": "a length of chain of the material associated to the plane you are on, worth at least 25 gp"
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You attempt to tether a creature to the plane you are on. The creature takes {@damage 2d8} force damage, and must make a Charisma saving throw. On a failure, the creature is pulled back between folds of space by ethereal chains, and the teleportation fails. A creature who fails to teleport as a result of this spell cannot teleport or be teleported again until the start of your next turn."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell with a spell slot of 4th level or higher, you can target two more creatures for each spell slot level above 3rd. The creatures must be attempting to teleport at the same time."
					]
				}
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Wizard",
						"source": "PHB"
					},
					{
						"name": "Ranger",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Wiz's Glacial Smite",
			"source": "NewSpells",
			"level": 4,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "bonus"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "self"
				}
			},
			"components": {
				"v": true
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1
					},
					"concentration": true
				}
			],
			"entries": [
				"The next time you hit a creature with a weapon attack before the spell ends, your weapon releases a blast of air from Cania, the Eighth Hell of Baator. ",
				"The supernatural cold flash-freezes your target, which takes {@damage 4d8} cold damage and must succeed on a Constitution saving throw or be {@condition restrained} for the duration. ",
				"If the creature has a flying speed and is currently in flight, it suffers most effects of the {@condition restrained} condition, but its speed is reduced to 1 foot instead of 0, unless the spell was triggered with a melee weapon attack."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 5th level or higher, the cold damage increases by {@damage 1d8} for each spell slot level above 4th."
					]
				}
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Paladin",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Redirect Entropy",
			"source": "NewSpells",
			"level": 2,
			"school": "A",
			"time": [
				{
					"number": 1,
					"unit": "reaction",
					"condition": "which you take when you are targeted by a spell"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 120
				}
			},
			"components": {
				"v": true,
				"s": true
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You tear away some of the energy of an incoming spell, and use it to flood a foe's mind. If the spell is of 1st level or lower, it is redirected. Otherwise, make an ability check using your spellcasting ability modifier, against a DC equal to 10 + the spell's level. On a success, the spell is redirected.",
				"When you redirect a spell, you automatically succeed on any saving throw imposed by the spell, and any attack roll the spell made against you automatically fails. You suffer any other effects of the spell as normal.",
				"Immediately after redirecting a spell, choose a creature within range. The target must make an Intelligence saving throw. On a failure, they take psychic damage equal to {@damage 1d8} + {@damage 1d8} per spell slot level of the spell you redirected."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 3rd level or higher, you automatically redirect a spell if its level is less than that of the spell slot you used."
					]
				}
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Sorcerer",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Thermal Lance",
			"source": "NewSpells",
			"level": 3,
			"school": "T",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 500
				}
			},
			"components": {
				"s": true,
				"m": {
					"text": "a small piece of raw silver, gold or platinum worth at least 5 gp, which the spell consumes",
					"consume": true,
					"cost": 500
				}
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You charge a piece of metal with magical energy, causing it to heat up and liquify, before launching it at a distant enemy. Make a ranged spell attack against a creature or object within range. ",
				"On a hit, the target takes {@damage 2d12} piercing damage and {@damage 2d12} fire damage as the thin line of molten metal burns through it. On a miss, the target only takes {@damage 1d12} fire damage. Flammable objects take maximum fire damage from this spell, and cannot provide cover for creatures behind them. "
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 4th level or higher, the piercing damage or the fire damage (your choice) that you deal on a hit increases by {@damage 1d12} for each spell slot level above 3rd."
					]
				}
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Sorcerer",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Weave Spark",
			"source": "NewSpells",
			"level": 0,
			"school": "V",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 60
				}
			},
			"components": {
				"v": true,
				"s": true
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You draw a brief spark of unstable magic from the Weave and launch it at a target before it dissipates. Make a ranged attack roll against a creature within range. On a hit, the target takes {@damage 1d4} damage.",
				"You choose the damage type of this spell whenever you gain a level in a class. The damage type may be acid, cold, fire, lightning or poison.",
				"If you use a Metamagic option on this spell, doing so does not cost you any sorcery points, though any other restrictions apply. If a Metamagic option or any other effect allows you to ignore verbal and somatic components when casting this spell, the spark is {@condition invisible} to everyone but you.",
				"The spell's damage increases by {@damage 1d4} when you reach 5th level ({@damage 2d4}), 11th level ({@damage 3d4}) and 17th level ({@damage 4d4})."
			],
			"conditionInflict": [
				"invisible"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Sorcerer",
						"source": "PHB"
					}
				]
			}
		},
		{
			"name": "Dimensional Rending",
			"source": "NewSpells",
			"level": 4,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 90
				}
			},
			"components": {
				"s": true,
				"m": "the claw of an unnatural or magical creature, such as a dragon or undead"
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You reach forward and pull your hands apart, causing a chaotic magical anomaly to rip a creature or object to shreds. One such target in range must make a Constitution saving throw. On a success, the target takes {@damage 2d6} force damage. On a failure, the target takes {@damage 9d6} force damage and its movement speed is halved until the end of its next turn."
			],
			"entriesHigherLevel": [
				{
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 5th level or higher, you can one target another creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them."
					]
				}
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Sorcerer",
						"source": "PHB"
					}
				]
			}
		}
	]
}